DEMO_THEMES = {
    'theme1': {
        'title': 'Звездные Войны',
        'description': 'A long time ago in a galaxy far, far away...',
        'creators': {
            'person1': {
                'name': 'Джордж Лукас', 'born': '1944-05-14', 'description': 'Американский продюсер и режисер',
            },
        },
        'cycles': {
            'cycle1': {
                'title': 'Оригинальная трилогия', 'description': 'Первые три фильма выходившие в 1977-1983 гг.',
                'movies': {
                    'movie1': {
                        'number': 1,
                        'title': 'Новая надежда', 'genre': 1, 'year': '1977',
                        'description': """
                            Идёт гражданская война. Космические корабли Повстанцев,
                            нанося удары со своей тайной базы, одержали первую победу над зловещей Галактической Империей.
                            Во время сражения разведчикам Повстанцев удалось выкрасть секретные чертежи мощнейшего оружия Империи,
                            которое называется ЗВЕЗДОЙ СМЕРТИ.
                            Это бронированная космическая станция, способная уничтожить целую планету.
                            Преследуемая злобными агентами Империи, королевна Лея торопится домой на борту своего звездолёта.
                            Она становится хранителем чертежей, которые могут спасти её народ и восстановить свободу галактики…
                            """,
                    },
                    'movie2': {
                        'number': 2,
                        'title': 'Империя наносит ответный удар', 'genre': 1, 'year': '1980',
                        'description': """
                            Для повстанцев настали тяжёлые времена. Хотя Звезда Смерти была уничтожена,
                            имперские войска выбили повстанцев с их базы и преследуют по всей галактике.
                            Избегая встречи с грозным Имперским звёздным флотом, группа борцов за свободу,
                            ведомая Люком Скайуокером, обустроила новую секретную базу на отдалённой заснеженной планете Хот.
                            Тёмный лорд ситхов Дарт Вейдер, одержимый желанием найти молодого Скайуокера,
                            разослал тысячи разведывательных зондов в самые далёкие уголки космоса…
                        """,
                    },
                    'movie3': {
                        'number': 3,
                        'title': 'Возвращение джедая', 'genre': 1, 'year': '1983',
                        'description': """
                             Люк Скайуокер вернулся на свою родную планету Татуин в попытке спасти своего друга
                             Хана Соло из лап мерзкого преступника Джаббы Хатта.
                             Люк не подозревает, что ГАЛАКТИЧЕСКАЯ ИМПЕРИЯ начала тайную постройку
                             новой бронированной космической станции, ещё более сильной,
                             чем первая страшная «Звезда Смерти». Когда постройка будет завершена,
                             это оружие предвестит гибель для маленькой группы мятежников,
                             изо всех сил пытающихся вернуть свободу галактике…
                        """,
                    },
                },
            },
            'cycle2': {
                'title': 'Трилогия приквелов', 'description': 'Фильмы, рассказывающие предисторию Оригинальной трилогии',
                'movies': {
                    'movie1': {
                        'number': 1,
                        'title': 'Скрытая угроза', 'genre': 1, 'year': '1999',
                        'description': """
                            События в фильме происходят в 32 году до Битвы при Явине
                            и за десять лет до начала войн клонов,
                            и являются своеобразной прелюдией к возвышению зла в Галактике,
                            называя этот период «Восходом Империи».
                            """,
                    },
                    'movie2': {
                        'number': 2,
                        'title': 'Атака клонов', 'genre': 1, 'year': '2002',
                        'description': """
                             В Галактическом Сенате неспокойно.
                             Несколько тысяч звёздных систем объявили о намерении выйти из состава Республики.
                             Движение сепаратистов, возглавляемых загадочным графом Дуку,
                             создало трудности малочисленным джедаям по сохранению мира и порядка в галактике.
                             Сенатор Амидала, бывшая королева Набу, возвращается в Галактический Сенат,
                             чтобы голосовать по принципиальному вопросу:
                             созданию АРМИИ РЕСПУБЛИКИ в помощь несправляющимся джедаям…
                        """,
                    },
                    'movie3': {
                        'number': 3,
                        'title': 'Месть ситхов', 'genre': 1, 'year': '2005',
                        'description': """
                            Идёт третий год Войн клонов. Галактическая Республика,
                            некогда бывшая спокойным и гармоничным государством,
                            превратилась в поле битвы между армиями клонов,
                            возглавляемых канцлером Палпатином, и армадами дроидов,
                            которых ведёт граф Дуку, тёмный лорд ситхов.
                            Республика медленно погружается во тьму.
                            Лишь рыцари-джедаи, защитники мира и справедливости, могут противостоять злу,
                            которое вскоре поглотит галактику.
                            Но настоящая битва идёт в душе у молодого рыцаря-джедая Энакина,
                            который разрывается между долгом джедая и любовью к своей жене,
                            сенатору Падме Амидале. И от того, какое чувство в нём победит,
                            зависит будущее всего мира.
                        """,
                    },
                },
            },
            'cycle3': {
                'title': 'Трилогия сиквелов', 'description': 'Фильмы, чье действие происходит через несколько лет после событий Оригинальной трилогии',
                'movies': {
                    'movie1': {
                        'number': 1,
                        'title': 'Пробуждение силы', 'genre': 1, 'year': '2015',
                        'description': """
                             Люк Скайуокер бесследно исчез.
                             В его отсутствие из пепла Империи возник ПЕРВЫЙ ОРДЕН
                             — грозная организация, которая задалась целью найти и уничтожить последнего Джедая.
                             При поддержке РЕСПУБЛИКИ крепнет движение СОПРОТИВЛЕНИЯ под началом Генерала Леи Органа.
                             Она отчаянно разыскивает брата и верит:
                             Люк поможет восстановить мир и справедливость в галактике.
                             Лея отправила лучшего из своих пилотов с тайной миссией на Джакку,
                             где, по словам старого союзника, нашлась ниточка, ведущая к Люку….
                            """,
                    },
                    'movie2': {
                        'number': 2,
                        'title': 'Последние джедаи', 'genre': 1, 'year': '2017',
                        'description': """
                              Власть ПЕРВОГО ОРДЕНА безраздельна. Покончив с мирной Республикой,
                              Верховный лидер Сноук рассылает по галактике свои легионы,
                              чтобы установить в ней военную диктатуру.
                              Насаждаемой тирании противятся лишь бойцы СОПРОТИВЛЕНИЯ
                              под началом генерала Леи Органы, свято верящие в то,
                              что мастер-джедай Люк Скайуокер вернётся, а с ним и искра надежды.
                              Однако база Сопротивления обнаружена,
                              к ней устремляются корабли Первого ордена,
                              и отважные герои готовят спешное отступление….
                        """,
                    },
                    'movie3': {
                        'number': 3,
                        'title': 'Скайуокер. Восход', 'genre': 1, 'year': '2019',
                        'description': """
                            Картина должна выйти на экраны 19 декабря 2019 года
                        """,
                    },
                },
            },
        },
    },
}

DEMO_PERSON_DEPENDENCES = {
    'person0': {
        'name': 'Джордж Лукас',
        'directed_movies': ["Месть ситхов", "Атака клонов", "Скрытая угроза", "Новая надежда"],
        'written_movies': ['Последние джедаи', "Пробуждение силы", "Месть ситхов", "Атака клонов", "Скрытая угроза", "Возвращение джедая", "Империя наносит ответный удар", "Новая надежда"],
    },
    'person1': {
        'name': 'Марк Хэмилл',
        'born': '1951-09-25',
    },
    'person2': {
        'name': 'Люк Скайуокер',
        'is_fictional': True,
        'description': 'один из главных персонажей вселенной «Звёздных войн», джедай, сын сенатора с Набу Падме Амидалы Наберри и рыцаря-джедая Энакина Скайуокера. ',
        'movie_appearences': {
            'Новая Надежда': {'acter_name': 'Марк Хэмилл', 'is_main': True},
            'Империя наносит ответный удар': {'acter_name': 'Марк Хэмилл', 'is_main': True},
            'Возвращение джедая': {'acter_name': 'Марк Хэмилл', 'is_main': True},
            'Последние джедаи': {'acter_name': 'Марк Хэмилл'},
        },
    },
    'person3': {
        'name': 'Кэрри Фишер',
        'born': '1956-10-21',
        'died': '2016-12-27',
    },
    'person4': {
        'name': 'Лея Органа',
        'is_fictional': True,
        'description': 'вымышленный персонаж вселенной «Звёздных войн»',
        'movie_appearences': {
            'Новая Надежда': {'acter_name': 'Кэрри Фишер', 'is_main': True},
            'Империя наносит ответный удар': {'acter_name': 'Кэрри Фишер', 'is_main': True},
            'Возвращение джедая': {'acter_name': 'Кэрри Фишер', 'is_main': True},
            'Пробуждение силы': {'acter_name': 'Кэрри Фишер'},
            'Последние джедаи': {'acter_name': 'Кэрри Фишер'},
        },
    },
    'person5': {
        'name': 'Харисон Форд',
        'born': '1942-07-13',
    },
    'person6': {
        'name': 'Хан Соло',
        'is_fictional': True,
        'description': 'один из главных героев киносаги «Звёздные войны»',
        'movie_appearences': {
            'Новая Надежда': {'acter_name': 'Харисон Форд', 'is_main': True},
            'Империя наносит ответный удар': {'acter_name': 'Харисон Форд', 'is_main': True},
            'Возвращение джедая': {'acter_name': 'Харисон Форд', 'is_main': True},
            'Пробуждение силы': {'acter_name': 'Харисон Форд'},
        },
    },
}

DEMO_QUESTIONS = {
    'movie_questions': {
        'Скрытая угроза': {
            'question_text': 'Королевой какой планеты была Падме?',
            'answers': ("Корусанд", "Амидала", "Набу", "Татуин"),
            'right_answer_number': 2,
        },
        'Новая надежда': {
            'question_text': 'На какую планут Оби-Ван Кеноби хотел отвезти Люка Скайуокера?',
            'answers': ("Корусанд", "Татуин", "Хот", "Алдераан"),
            'right_answer_number': 3,
        },
        'Пробуждение силы': {
            'question_text': 'На какой планете Кайло Рен захватил Рей?',
            'answers': ("Такодана", "Нирвана", "Тео", "Джиндей"),
            'right_answer_number': 0,
        },
    },
    'preson_questions': {
        'Харисон Форд': {
            'question_text': 'За какой фильм Харисон Форд удостоился номинации на Оскар?',
            'answers': ("Возвращение джедая", "Свидетель", "Беглец", "Самолет Президента"),
            'right_answer_number': 1,
        },
        'Лея Органа': {
            'question_text': 'Как звали приемного отца Леи?',
            'answers': ("Оби-Ван", "Квай-Гон", "Бейл", "Дуку"),
            'right_answer_number': 2,
        },
        'Люк Скайуокер': {
            'question_text': 'Где скрывалс Люк Скайуокер после сожжения школы джедаев?',
            'answers': ("Татуин", "Алдераан", "Акх-то", "Силеран"),
            'right_answer_number': 2,
        },
    },
}
